TerryFogg/nfNative/Targets/Azure/STM32H735G_DK_nanoCLR/Target Features/HyperbusRam.h
#pragma once
//
// Copyright (c) .NET Foundation and Contributors
// Portions Copyright (c) 2021 STMicroelectronics.  All rights reserved.
// See LICENSE file in the project root for full license information.
//

#include "stm32h7xx.h" // Includes    "stm32h735xx.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_rcc.h"
#include <stm32h7xx_ll_sdmmc.h>
#include <stm32h7xx_ll_tim.h>

//---------------------------------------------------------------------------------------------
// Definition for hyperam

//------------------------------------------------------------------------------
#define OSPI_HYPERRAM_SIZE      24
#define OSPI_HYPERRAM_INCR_SIZE 256

// Timing of the HyperRAM
#define OSPI_HYPERRAM_RW_REC_TIME 3
#define OSPI_HYPERRAM_LATENCY     6

// End address of the OSPI memory
#define OSPI_HYPERRAM_END_ADDR (1 << OSPI_HYPERRAM_SIZE)

// Definition for OCTOSPI2 Pins
#define OSPI2_CS_PIN       GPIO_PIN_12
#define OSPI2_CS_GPIO_PORT GPIOG

#define OSPI2_CLK_PIN       GPIO_PIN_4
#define OSPI2_CLK_GPIO_PORT GPIOF

#define OSPI2_D0_PIN       GPIO_PIN_0
#define OSPI2_D0_GPIO_PORT GPIOF

#define OSPI2_D1_PIN       GPIO_PIN_1
#define OSPI2_D1_GPIO_PORT GPIOF

#define OSPI2_D2_PIN       GPIO_PIN_2
#define OSPI2_D2_GPIO_PORT GPIOF

#define OSPI2_D3_PIN       GPIO_PIN_3
#define OSPI2_D3_GPIO_PORT GPIOF

#define OSPI2_D4_PIN       GPIO_PIN_0
#define OSPI2_D4_GPIO_PORT GPIOG

#define OSPI2_D5_PIN       GPIO_PIN_1
#define OSPI2_D5_GPIO_PORT GPIOG

#define OSPI2_D6_PIN       GPIO_PIN_10
#define OSPI2_D6_GPIO_PORT GPIOG

#define OSPI2_D7_PIN       GPIO_PIN_11
#define OSPI2_D7_GPIO_PORT GPIOG

#define OSPI2_DQS_PIN       GPIO_PIN_12
#define OSPI2_DQS_GPIO_PORT GPIOF

/* Definition for OSPI clock resources */
#define OSPI_RAM_CLK_ENABLE()  __HAL_RCC_OSPI2_CLK_ENABLE()
#define OSPI_RAM_CLK_DISABLE() __HAL_RCC_OSPI2_CLK_DISABLE()

#define OSPI_RAM_FORCE_RESET()   __HAL_RCC_OSPI2_FORCE_RESET()
#define OSPI_RAM_RELEASE_RESET() __HAL_RCC_OSPI2_RELEASE_RESET()

/* Definition for OSPI RAM Pins */
#define OSPI_RAM_CS_GPIO_CLK_ENABLE() __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI_RAM_CS_PIN               GPIO_PIN_12
#define OSPI_RAM_CS_GPIO_PORT         GPIOG
#define OSPI_RAM_CS_PIN_AF            GPIO_AF3_OCTOSPIM_P2

#define OSPI_RAM_CLK_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI_RAM_CLK_PIN               GPIO_PIN_4
#define OSPI_RAM_CLK_GPIO_PORT         GPIOF
#define OSPI_RAM_CLK_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_DQS_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI_RAM_DQS_PIN               GPIO_PIN_12
#define OSPI_RAM_DQS_GPIO_PORT         GPIOF
#define OSPI_RAM_DQS_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D0_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI_RAM_D0_PIN               GPIO_PIN_0
#define OSPI_RAM_D0_GPIO_PORT         GPIOF
#define OSPI_RAM_D0_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D1_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI_RAM_D1_PIN               GPIO_PIN_1
#define OSPI_RAM_D1_GPIO_PORT         GPIOF
#define OSPI_RAM_D1_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D2_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI_RAM_D2_PIN               GPIO_PIN_2
#define OSPI_RAM_D2_GPIO_PORT         GPIOF
#define OSPI_RAM_D2_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D3_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI_RAM_D3_PIN               GPIO_PIN_3
#define OSPI_RAM_D3_GPIO_PORT         GPIOF
#define OSPI_RAM_D3_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D4_GPIO_CLK_ENABLE() __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI_RAM_D4_PIN               GPIO_PIN_0
#define OSPI_RAM_D4_GPIO_PORT         GPIOG
#define OSPI_RAM_D4_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D5_GPIO_CLK_ENABLE() __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI_RAM_D5_PIN               GPIO_PIN_1
#define OSPI_RAM_D5_GPIO_PORT         GPIOG
#define OSPI_RAM_D5_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define OSPI_RAM_D6_GPIO_CLK_ENABLE() __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI_RAM_D6_PIN               GPIO_PIN_10
#define OSPI_RAM_D6_GPIO_PORT         GPIOG
#define OSPI_RAM_D6_PIN_AF            GPIO_AF3_OCTOSPIM_P2

#define OSPI_RAM_D7_GPIO_CLK_ENABLE() __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI_RAM_D7_PIN               GPIO_PIN_11
#define OSPI_RAM_D7_GPIO_PORT         GPIOG
#define OSPI_RAM_D7_PIN_AF            GPIO_AF9_OCTOSPIM_P2

#define S70KL1281_RAM_SIZE         0x1000000 /* 128 MBits => 16 MBytes */
#define BSP_OSPI_RAM_BurstLength_t S70KL1281_BurstLength_t

#define S70KL1281_CR0_BLENGTH_128 0x0000U /*!< 128 bytes burst length */
#define S70KL1281_CR0_BLENGTH_64  0x0001U /*!< 64 bytes burst length */
#define S70KL1281_CR0_BLENGTH_16  0x0002U /*!< 16 bytes burst length */
#define S70KL1281_CR0_BLENGTH_32  0x0003U /*!< 32 bytes burst length */

typedef enum
{
    S70KL1281_BURST_16_BYTES = S70KL1281_CR0_BLENGTH_16,
    S70KL1281_BURST_32_BYTES = S70KL1281_CR0_BLENGTH_32,
    S70KL1281_BURST_64_BYTES = S70KL1281_CR0_BLENGTH_64,
    S70KL1281_BURST_128_BYTES = S70KL1281_CR0_BLENGTH_128
} S70KL1281_BurstLength_t;

#define S70KL1281_CR0_BLENGTH_32 0x0003U /*!< 32 bytes burst length */

#define BSP_OSPI_RAM_BURST_32_BYTES         (BSP_OSPI_RAM_BurstLength_t) S70KL1281_CR0_BLENGTH_32
#define OSPI_FUNCTIONAL_MODE_INDIRECT_READ  ((uint32_t)OCTOSPI_CR_FMODE_0) /*!< Indirect read mode     */
#define OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED  ((uint32_t)OCTOSPI_CR_FMODE)   /*!< Memory-mapped mode     */
#define OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE ((uint32_t)0x00000000)         /*!< Indirect write mode    */

#define __HAL_OSPI_ENABLE(__HANDLE__)                   SET_BIT((__HANDLE__)->Instance->CR, OCTOSPI_CR_EN)
#define HAL_OSPI_DUALQUAD_DISABLE                       ((uint32_t)0x00000000U)         // Dual-Quad mode disabled */
#define HAL_OSPI_MEMTYPE_HYPERBUS                       ((uint32_t)OCTOSPI_DCR1_MTYP_2) // Hyperbus mode     */
#define HAL_OSPI_FREERUNCLK_DISABLE                     ((uint32_t)0x00000000U) // CLK is not free running               */
#define HAL_OSPI_CLOCK_MODE_0                           ((uint32_t)0x00000000U) // CLK must stay low while nCS is high  */
#define HAL_OSPI_WRAP_NOT_SUPPORTED                     ((uint32_t)0x00000000U) // wrapped reads are not supported by the memory
#define HAL_OSPI_SAMPLE_SHIFTING_NONE                   ((uint32_t)0x00000000U)      /*!< No shift        */
#define HAL_OSPI_DHQC_ENABLE                            ((uint32_t)OCTOSPI_TCR_DHQC) /*!< Delay Hold 1/4 cycle */
#define HAL_OSPI_ADDRESS_NONE                           ((uint32_t)0x00000000U)      /*!< No address               */
#define HAL_OSPI_LATENCY_ON_WRITE                       ((uint32_t)0x00000000U)     /*!< Latency on write accesses    */
#define HAL_OSPI_FIXED_LATENCY                          ((uint32_t)OCTOSPI_HLCR_LM) /*!< Fixed latency            */
#define HAL_OSPI_TIMEOUT_DEFAULT_VALUE                  ((uint32_t)5000U)           /* 5 s */
#define __HAL_OSPI_ENABLE_IT(__HANDLE__, __INTERRUPT__) SET_BIT((__HANDLE__)->Instance->CR, (__INTERRUPT__))
#define HAL_OSPI_FLAG_TC                                OCTOSPI_SR_TCF // Programmed number of data have been transferred or aborted
#define HAL_OSPI_FLAG_FT                                                                                               \
    OCTOSPI_SR_FTF // Fifo threshold reached or data left after read from memory
                   // is complete
#define HAL_OSPI_ERROR_INVALID_PARAM     ((uint32_t)0x00000008U) /*!< Invalid parameters error                   */
#define HAL_OSPI_REGISTER_ADDRESS_SPACE  ((uint32_t)OCTOSPI_DCR1_MTYP_0) /*!< HyperBus register mode */
#define HAL_OSPI_NO_LATENCY_ON_WRITE     ((uint32_t)OCTOSPI_HLCR_WZL)    /*!< No latency on write accesses */
#define HAL_OSPI_MEMORY_ADDRESS_SPACE    ((uint32_t)0x00000000U)         /*!< HyperBus memory mode   */
#define HAL_OSPI_ADDRESS_32_BITS         ((uint32_t)OCTOSPI_CCR_ADSIZE)  /*!< 32-bit address */
#define HAL_OSPI_DQS_ENABLE              ((uint32_t)OCTOSPI_CCR_DQSE)    /*!< DQS enabled  */
#define HAL_OSPI_TIMEOUT_COUNTER_DISABLE ((uint32_t)0x00000000U) /*!< Timeout counter disabled, nCS remains active */
#define HAL_OSPI_ERROR_INVALID_SEQUENCE  ((uint32_t)0x00000010U) /*!< Sequence of the state machine is incorrect */
#define HAL_OSPI_ERROR_NONE              ((uint32_t)0x00000000U) /*!< No error                                   */
#define HAL_OSPI_STATE_RESET             ((uint32_t)0x00000000U) /*!< Initial state */
#define HAL_OSPI_FREERUNCLK_ENABLE       ((uint32_t)OCTOSPI_DCR1_FRCK) /*!< CLK is free running (always provided) */
#define HAL_OSPI_STATE_HYPERBUS_INIT                                                                                   \
    ((uint32_t)0x00000001U)                                    // Initialization done in hyperbus mode but timing
                                                               // configuration not done
#define HAL_OSPI_STATE_BUSY_MEM_MAPPED ((uint32_t)0x00000088U) /*!< Memory-mapped on-going */
#define HAL_OSPI_TIMEOUT_COUNTER_ENABLE                                                                                \
    ((uint32_t)OCTOSPI_CR_TCEN)                        // Timeout counter enabled, nCS released when
                                                       // timeout expires
#define HAL_OSPI_FLAG_TO       OCTOSPI_SR_TOF          /*!< Timeout flag: timeout occurs in memory-mapped mode */
#define HAL_OSPI_IT_TO         OCTOSPI_CR_TOIE         /*!< Interrupt on the timeout flag           */
#define HAL_OSPI_STATE_ERROR   ((uint32_t)0x00000200U) // Blocking error, driver should be re-initialized
#define HAL_OSPI_ERROR_TIMEOUT ((uint32_t)0x00000001U) /*!< Timeout error                              */
#define __HAL_OSPI_GET_FLAG(__HANDLE__, __FLAG__)                                                                      \
    ((READ_BIT((__HANDLE__)->Instance->SR, (__FLAG__)) != 0U) ? SET : RESET)
#define __HAL_OSPI_CLEAR_FLAG(__HANDLE__, __FLAG__) WRITE_REG((__HANDLE__)->Instance->FCR, (__FLAG__))
#define HAL_OSPI_STATE_READY                        ((uint32_t)0x00000002U) /*!< Driver ready to be used */
#define HAL_OSPI_FLAG_BUSY                          OCTOSPI_SR_BUSY         /*!< Busy flag: operation is ongoing */
#define HAL_OSPI_STATE_CMD_CFG                                                                                         \
    ((uint32_t)0x00000004U) // Command (regular or hyperbus) configured, ready for
                            // an action

#define RW_RECOVERY_TIME                      3U /* 40ns @ 60MHz */
#define DEFAULT_INITIAL_LATENCY               6U
#define OPTIMAL_FIXED_INITIAL_LATENCY         3U
#define S70KL1281_CR0_IL_3_CLOCK              0x00E0U /*!< 3 clock latency */
#define S70KL1281_CR0_FLE                     0x0008U /*!< Fixed latency enable */
#define S70KL1281_CR0_IL                      0x00F0U /*!< Initial latency */
#define S70KL1281_CR0_HBE                     0x0004U /*!< Hybrid burst enable */
#define S70KL1281_CR0_BLENGTH                 0x0003U /*!< Burst length */
#define S70KL1281_CR0_ADDRESS                 0x00001000U
#define S70KL1281_ERROR                       (-1)
#define S70KL1281_OK                          (0)
#define OPTIMAL_FIXED_INITIAL_LATENCY_REG_VAL S70KL1281_CR0_IL_3_CLOCK

// Definition for OCTOSPI2 clock resources

#define OSPI2_CLK_ENABLE()            __HAL_RCC_OSPI2_CLK_ENABLE()
#define OSPI2_CLK_DISABLE()           __HAL_RCC_OSPI2_CLK_DISABLE()
#define OSPI2_CS_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI2_CLK_P_GPIO_CLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI2_D0_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI2_D1_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI2_D2_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI2_D3_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOF_CLK_ENABLE()
#define OSPI2_D4_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI2_D5_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI2_D6_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI2_D7_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()
#define OSPI2_DQS_GPIO_CLK_ENABLE()   __HAL_RCC_GPIOF_CLK_ENABLE()

#define OSP2_FORCE_RESET()   __HAL_RCC_OSPI2_FORCE_RESET()
#define OSP2_RELEASE_RESET() __HAL_RCC_OSPI2_RELEASE_RESET()

