TerryFogg/nfNative/Targets/Azure/STM32H735G_DK_nanoCLR/Target Features/HyperbusRam.h
typedef enum
{
    HAL_MDMA_STATE_RESET = 0x00U, /*!< MDMA not yet initialized or disabled */
    HAL_MDMA_STATE_READY = 0x01U, /*!< MDMA initialized and ready for use   */
    HAL_MDMA_STATE_BUSY = 0x02U,  /*!< MDMA process is ongoing              */
    HAL_MDMA_STATE_ERROR = 0x03U, /*!< MDMA error state                     */
    HAL_MDMA_STATE_ABORT = 0x04U, /*!< MDMA Abort state                     */

} HAL_MDMA_StateTypeDef;

typedef struct
{
    __IO uint32_t CTCR;     /*!< New CTCR register configuration for the given MDMA
                               linked list node   */
    __IO uint32_t CBNDTR;   /*!< New CBNDTR register configuration for the given
                               MDMA linked list node */
    __IO uint32_t CSAR;     /*!< New CSAR register configuration for the given MDMA
                               linked list node   */
    __IO uint32_t CDAR;     /*!< New CDAR register configuration for the given MDMA
                               linked list node   */
    __IO uint32_t CBRUR;    /*!< New CBRUR register configuration for the given MDMA
                               linked list node  */
    __IO uint32_t CLAR;     /*!< New CLAR register configuration for the given MDMA
                               linked list node   */
    __IO uint32_t CTBR;     /*!< New CTBR register configuration for the given MDMA
                               linked list node   */
    __IO uint32_t Reserved; /*!< Reserved register */
    __IO uint32_t CMAR;     /*!< New CMAR register configuration for the given MDMA
                               linked list node   */
    __IO uint32_t CMDR;     /*!< New CMDR register configuration for the given MDMA
                               linked list node   */

} MDMA_LinkNodeTypeDef;

typedef struct
{

    uint32_t Request; /*!< Specifies the MDMA request.
                          This parameter can be a value of @ref
                         MDMA_Request_selection*/

    uint32_t TransferTriggerMode; /*!< Specifies the Trigger Transfer mode : each
                                     request triggers a : a buffer transfer, a block
                                     transfer, a repeated block transfer or a linked
                                     list transfer This parameter can be a value of
                                     @ref MDMA_Transfer_TriggerMode  */

    uint32_t Priority; /*!< Specifies the software priority for the MDMAy channelx.
                           This parameter can be a value of @ref MDMA_Priority_level */

    uint32_t Endianness; /*!< Specifies if the MDMA transactions preserve the
                            Little endianness. This parameter can be a value of
                            @ref MDMA_Endianness */

    uint32_t SourceInc; /*!< Specifies if the Source increment mode .
                            This parameter can be a value of @ref
                           MDMA_Source_increment_mode */

    uint32_t DestinationInc; /*!< Specifies if the Destination increment mode .
                                 This parameter can be a value of @ref
                                MDMA_Destination_increment_mode */

    uint32_t SourceDataSize; /*!< Specifies the source data size.
                                 This parameter can be a value of @ref
                                MDMA_Source_data_size */

    uint32_t DestDataSize; /*!< Specifies the destination data size.
                                This parameter can be a value of @ref
                              MDMA_Destination_data_size */

    uint32_t DataAlignment; /*!< Specifies the source to destination Memory data
                               packing/padding mode. This parameter can be a value of
                               @ref MDMA_data_Alignment */

    uint32_t BufferTransferLength; /*!< Specifies the buffer Transfer Length
                                      (number of bytes), this is the number of
                                      bytes to be transferred in a single transfer
                                      (1 byte to 128 bytes)*/

    uint32_t SourceBurst; /*!< Specifies the Burst transfer configuration for the
                             source memory transfers. It specifies the amount of data
                             to be transferred in a single non interruptable
                              transaction.
                              This parameter can be a value of @ref MDMA_Source_burst
                              @note : the burst may be FIXED/INCR based on SourceInc
                             value , the BURST must be programmed as to ensure that the
                             burst size will be lower than than BufferTransferLength */

    uint32_t DestBurst; /*!< Specifies the Burst transfer configuration for the
                           destination memory transfers. It specifies the amount
                           of data to be transferred in a single non interruptable
                             transaction.
                             This parameter can be a value of @ref
                           MDMA_Destination_burst
                             @note : the burst may be FIXED/INCR based on
                           DestinationInc value , the BURST must be programmed as
                           to ensure that the burst size will be lower than than
                             BufferTransferLength */

    int32_t SourceBlockAddressOffset; /*!< this field specifies the Next block source
                                         address offset signed value : if > 0 then
                                         increment the next block source Address by
                                         offset from where the last block ends if < 0
                                         then  decrement the next block source Address
                                         by offset from where the last block ends if
                                         == 0, the next block source address starts
                                         from where the last block ends
                                       */

