TerryFogg/nfNative/Targets/Azure/STM32H735G_DK_nanoCLR/Target Features/HyperbusRam.h
    int32_t DestBlockAddressOffset; /*!< this field specifies the Next block
                                       destination address offset signed value :
                                       if > 0 then  increment the next block
                                       destination Address by offset from where
                                       the last block ends if < 0 then  decrement
                                       the next block destination Address by
                                       offset from where the last block ends if ==
                                       0, the next block destination address
                                       starts from where the last block ends
                                    */

} MDMA_InitTypeDef;

typedef struct
{
    uint32_t FifoThreshold;         /* This is the threshold used by the Peripheral to generate
                                       the interrupt indicating that data are available in
                                       reception or free place is available in transmission.
                                       This parameter can be a value between 1 and 32 */
    uint32_t DualQuad;              /* It enables or not the dual-quad mode which allow to
                                       access up to quad mode on two different devices to
                                       increase the throughput. This parameter can be a value
                                       of @ref OSPI_DualQuad */
    uint32_t MemoryType;            /* It indicates the external device type connected to the
                                       OSPI. This parameter can be a value of @ref
                                       OSPI_MemoryType */
    uint32_t DeviceSize;            /* It defines the size of the external device connected
                                       to the OSPI, it corresponds to the number of address
                                       bits required to access the external device. This
                                       parameter can be a value between 1 and 32 */
    uint32_t ChipSelectHighTime;    /* It defines the minimun number of clocks which the
                                       chip select must remain high between commands.
                                       This parameter can be a value between 1 and 8 */
    uint32_t FreeRunningClock;      /* It enables or not the free running clock.
                                       This parameter can be a value of @ref
                                       OSPI_FreeRunningClock */
    uint32_t ClockMode;             /* It indicates the level of clock when the chip select is
                                       released. This parameter can be a value of @ref
                                       OSPI_ClockMode */
    uint32_t WrapSize;              /* It indicates the wrap-size corresponding the external
                                       device configuration.  This parameter can be a value of
                                       @ref OSPI_WrapSize */
    uint32_t ClockPrescaler;        /* It specifies the prescaler factor used for generating
                                       the external clock based on the AHB clock.
                                       This parameter can be a value between 1 and 256 */
    uint32_t SampleShifting;        /* It allows to delay to 1/2 cycle the data sampling
                                       in order to take in account external signal
                                       delays. This parameter can be a value of @ref
                                       OSPI_SampleShifting */
    uint32_t DelayHoldQuarterCycle; /* It allows to hold to 1/4 cycle the data.
                                       This parameter can be a value of @ref
                                       OSPI_DelayHoldQuarterCycle */
    uint32_t ChipSelectBoundary;    /* It enables the transaction boundary feature and
                                       defines the boundary of bytes to release the chip
                                       select.
                                       This parameter can be a value between 0 and 31 */
    uint32_t ClkChipSelectHighTime; /* It defines the number of clocks provided on the
                                       CLK/nCLK pins when the chip select is set to
                                       high at the end of a transaction.
                                       This parameter can be a value between 0 and 7 */
    uint32_t DelayBlockBypass;      /* It enables the delay block bypass, so the
                                       sampling is not affected by the delay block.
                                       This parameter can be a value of @ref
                                       OSPI_DelayBlockBypass */
    uint32_t MaxTran;               /* It enables the communication regulation feature. The chip
                                       select is released every MaxTran+1 bytes when the other
                                       OctoSPI request the access to the bus.
                                       This parameter can be a value between 0 and 255 */
    uint32_t Refresh;               /* It enables the refresh rate feature. The chip select is
                                       released every Refresh+1 clock cycles.
                                       This parameter can be a value between 0 and 0xFFFFFFFF */
} OSPI_InitTypeDef;

typedef struct __MDMA_HandleTypeDef
{
    MDMA_Channel_TypeDef *Instance; /*!< Register base address                  */

    MDMA_InitTypeDef Init; /*!< MDMA communication parameters          */

    HAL_LockTypeDef Lock; /*!< MDMA locking object                    */

    __IO HAL_MDMA_StateTypeDef State; /*!< MDMA transfer state */

    void *Parent; /*!< Parent object state                    */

    void (*XferCpltCallback)(struct __MDMA_HandleTypeDef *hmdma); /*!< MDMA transfer complete callback */

    void (*XferBufferCpltCallback)(struct __MDMA_HandleTypeDef *hmdma); /*!< MDMA buffer transfer complete callback */

    void (*XferBlockCpltCallback)(struct __MDMA_HandleTypeDef *hmdma); /*!< MDMA block transfer complete callback  */

    void (*XferRepeatBlockCpltCallback)(
        struct __MDMA_HandleTypeDef *hmdma); /*!< MDMA block transfer repeat callback    */

    void (*XferErrorCallback)(struct __MDMA_HandleTypeDef *hmdma); /*!< MDMA transfer error callback */

    void (*XferAbortCallback)(struct __MDMA_HandleTypeDef *hmdma); /*!< MDMA transfer Abort callback */

    MDMA_LinkNodeTypeDef *FirstLinkedListNodeAddress; /*!< specifies the first node address of the
                                                         transfer list (after the initial node
                                                         defined by the Init struct) this parameter
                                                         is used internally by the MDMA driver to
                                                         construct the linked list node
                                                      */

    MDMA_LinkNodeTypeDef *LastLinkedListNodeAddress; /*!< specifies the last node address of the
                                                        transfer list this parameter is used
                                                        internally by the MDMA driver to construct
                                                        the linked list node
                                                      */
    uint32_t LinkedListNodeCounter;                  /*!< Number of nodes in the MDMA linked list */

