TerryFogg/nfNative/Targets/Azure/STM32H735G_DK_nanoCLR/Target Features/HyperbusRam.h
    __IO uint32_t ErrorCode; /*!< MDMA Error code                        */

} MDMA_HandleTypeDef;

typedef struct
{
    OCTOSPI_TypeDef *Instance; /* OSPI registers base address */
    OSPI_InitTypeDef Init;     /* OSPI initialization parameters                   */
    uint8_t *pBuffPtr;         /* Address of the OSPI buffer for transfer          */
    __IO uint32_t XferSize;    /* Number of data to transfer                       */
    __IO uint32_t XferCount;   /* Counter of data transferred */
    MDMA_HandleTypeDef *hmdma; /* Handle of the MDMA channel used for the transfer  */
    __IO uint32_t State;       /* Internal state of the OSPI HAL driver            */
    __IO uint32_t ErrorCode;   /* Error code in case of HAL driver internal error  */
    uint32_t Timeout;          /* Timeout used for the OSPI external device access */
} OSPI_HandleTypeDef;

typedef struct
{
    uint32_t RWRecoveryTime;   /* It indicates the number of cycles for the device
                                  read write recovery time.
                                  This parameter can be a value between 0 and 255 */
    uint32_t AccessTime;       /* It indicates the number of cycles for the device acces
                                  time. This parameter can be a value between 0 and 255 */
    uint32_t WriteZeroLatency; /* It enables or not the latency for the write
                                  access. This parameter can be a value of @ref
                                  OSPI_WriteZeroLatency */
    uint32_t LatencyMode;      /* It configures the latency mode.
                                  This parameter can be a value of @ref OSPI_LatencyMode */
} OSPI_HyperbusCfgTypeDef;

typedef struct
{
    uint32_t TimeOutActivation; /* Specifies if the timeout counter is enabled to
                                   release the chip select.  This parameter can be
                                   a value of @ref OSPI_TimeOutActivation */
    uint32_t TimeOutPeriod;     /* Specifies the number of clock to wait when the FIFO
                                   is full before to release the chip select. This
                                   parameter can be any value between 0 and 0xFFFF */
} OSPI_MemoryMappedTypeDef;
typedef struct
{
    uint32_t AddressSpace; /* It indicates the address space accessed by the
                              command. This parameter can be a value of @ref
                              OSPI_AddressSpace */
    uint32_t Address;      /* It contains the address to be sent tot he device.
                              This parameter can be a value between 0 and 0xFFFFFFFF */
    uint32_t AddressSize;  /* It indicates the size of the address.
                              This parameter can be a value of @ref OSPI_AddressSize */
    uint32_t NbData;       /* It indicates the number of data transferred with this command.
                              This field is only used for indirect mode.
                              This parameter can be a value between 1 and 0xFFFFFFFF
                              In case of autopolling mode, this parameter can be any value
                              between 1 and 4 */
    uint32_t DQSMode;      /* It enables or not the data strobe management.
                              This parameter can be a value of @ref OSPI_DQSMode */
} OSPI_HyperbusCmdTypeDef;
